Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.partID
The identifier of the physical part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.partName
The name of the physical part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.partType
The type of the physical part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisType
The analysis type of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.material
The material of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.profile
The profile of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.overrideProfile
The override profile of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.coordinateSystem
The coordinate system of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.upDirection
The up direction of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.curvature
The radius of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisPartAnalysisProperties
The analysis part analysis properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisPartCompositeProperties
The analysis part composite properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisPartSpanningProperties
The analysis part spanning properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisPartLoadingProperties
The analysis part loading properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisPartPositionProperties
The analysis part position properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisPartBarAttributes
The analysis part bar attributes.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisPartAreaAttributes
The analysis part area attributes.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.analysisDesignCode
The analysis design code.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.loadBearingOrder
The load bearing order.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.snapDistance
The snap distance.